Tekla Open API Reference for Tekla Structures 2025
LinkBase Properties
The LinkBase type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle of the link.
Attributes
 Gets or sets the link attributes.
InsertionPoint
 Gets or sets the insertion point of the link.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Text
 Gets or sets the link text that is visible on the screen.
Top
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace